{
  "personal": {
    "name": "Jay Shah",
    "title": "Software Engineering Student",
    "university": "King's College London",
    "graduationDate": "May 2026",
    "expectedGrade": "First Class Honours",
    "intro": "I'm a Computer Science student at King's College London, focused on machine learning, data-driven systems, and building reliable software. I enjoy working across the stack and on problems that reward strong quantitative reasoning.",
    "email": "jr-shah@outlook.com",
    "linkedin": "https://www.linkedin.com/in/jayrshah41/",
    "github": "https://github.com/jays41",
    "cv": {
      "downloadUrl": "/docs/Jay_Shah_CV.pdf",
      "browserUrl": "/docs/Jay_Shah_CV.pdf"
    }
  },
  "about": {
    "paragraphs": [
      "Currently pursuing a BSc in Computer Science at King's College London, where I'm expected to graduate with First Class Honours in May 2026.",
      "My journey in technology began early, starting with Python in Year 6 through Code Club. Since then, I've developed expertise across the full stack, from machine learning algorithms to user interfaces.",
      "I'm particularly drawn to projects that combine technical complexity with real-world impact, whether that's building sentiment analysis tools for financial markets or creating data-driven applications that solve genuine problems."
    ],
    "highlights": [
      {
        "title": "Currently",
        "description": "Software Engineering Student at King's College London, specializing in full-stack development and machine learning applications."
      },
      {
        "title": "Recent Experience",
        "description": "Software Engineering Intern at HubSpot, contributing to Data Studio and improving product reliability for thousands of customers."
      },
      {
        "title": "Research & Innovation",
        "description": "Co-authored research on FinBERT applications for sentiment analysis and developed quantitative portfolio models for Deutsche Bank."
      }
    ]
  },
  "experience": [
    {
      "company": "King's College London",
      "title": "BSc Computer Science",
      "location": "London",
      "date": "September 2023 - May 2026",
      "image": "/assets/images/education/kcl.png",
      "color": "red",
      "type": "education",
      "points": [
        "Expected First Class Honours degree in Computer Science"
      ]
    },
    {
      "company": "Roundwood Park School",
      "title": "A-Levels & GCSEs",
      "location": "Harpenden",
      "date": "2016 - 2023",
      "image": "/assets/images/education/rps.png",
      "color": "repeating-linear-gradient(135deg, red, red 10px, black 10px, black 30px)",
      "type": "education",
      "points": [
        "A-Levels: Maths (A*), Further Maths (A*), Computer Science (A), Physics (A)",
        "GCSEs: 999999999",
        "Junior Mathematical Olympiad (2018): Achieved Distinction and Medal, ranking in the top 200 nationally",
        "Intermediate Mathematical Olympiad - Cayley (2019): Earned Distinction and Medal, placing in the top 100 nationally"
      ]
    },
    {
      "company": "HubSpot",
      "title": "Software Engineering Intern",
      "location": "London / Dublin",
      "date": "July - September 2025",
      "image": "/assets/images/experience/hubspot.png",
      "color": "#FF7A57",
      "type": "experience",
      "points": [
        "Contributed to Data Studio, a flagship HubSpot feature launched at INBOUND 2025 and now used by thousands of customers",
        "Engineered a smart account verification polling system, reducing recovery time after verification errors from minutes to seconds and eliminating stale verification states",
        "Built an intelligent sync restart mechanism, reducing redundant API calls and improving sync throughput and reliability",
        "Strengthened product reliability with expanded automated test coverage, reducing regressions and supporting production releases"
      ]
    },
    {
      "company": "Ashbury Global",
      "title": "Data Administrator",
      "location": "London / Remote",
      "date": "July - September 2024",
      "image": "/assets/images/experience/ashbury.webp",
      "color": "linear-gradient(to bottom, orange, yellow, green)",
      "type": "experience",
      "points": [
        "Cleansed and validated client data for major retailers such as Aldi, Tesco, Waitrose, and Greggs, ensuring accuracy and readiness for migration to the company's new system",
        "Automated data validation using Python, improving efficiency by up to 12 times compared to the manual approach previously used by the team"
      ]
    },
    {
      "company": "Valtech",
      "title": "Software Developer Intern",
      "location": "London",
      "date": "June - July 2024",
      "image": "/assets/images/experience/valtech.png",
      "color": "black",
      "type": "experience",
      "points": [
        "Collaborated in a team developing front-end components for Ocado Technologies",
        "Independently designed and implemented new features using React.js",
        "Critiqued and reviewed code solutions proposed by team members before deployment",
        "Designed tests using the Jest framework with TypeScript to guarantee code correctness and reliability"
      ]
    },
    {
      "company": "Armalytix",
      "title": "Software Developer Work Experience",
      "location": "London",
      "date": "May 2022",
      "image": "/assets/images/experience/armalytix.png",
      "color": "#93002C",
      "type": "experience",
      "points": [
        "Conducted research and development into the use of machine learning algorithms using TensorFlow to categorise transactions in the company's database",
        "Automated API testing using Postman, enabling scalable and repeatable test suites for continuous integration",
        "Developed and automated end-to-end tests using Playwright in Python, reducing manual testing time"
      ]
    }
  ],
  "skills": {
    "categories": [
      {
        "title": "Languages",
        "skills": [
          {
            "name": "Python",
            "description": "Used extensively for machine learning, quantitative modelling, and backend development. Built end-to-end ML systems including an LSTM stock predictor, recommendation APIs, and robotics control software. Used professionally for ML research at Armalytix and data automation at Ashbury Global. Proficient with pandas, NumPy, scikit-learn, Django, and Flask."
          },
          {
            "name": "JavaScript",
            "description": "Frontend-focused, with experience building responsive, component-driven interfaces in React for production and personal projects, including this site, a meal planner, and a client data warehouse interface. Comfortable with modern JavaScript (ES6+), async patterns, DOM manipulation, and REST API integration."
          },
          {
            "name": "Java",
            "description": "Strong object-oriented foundations from university coursework, with projects including a visualisation tool for COVID-19 spread in London."
          },
          {
            "name": "C++",
            "description": "Applied to algorithmic problem-solving and quantitative projects. Built solvers and optimisers (countdown solver, string construction optimiser, Sudoku-like puzzle solver) and used C++ for prototyping quantitative trading strategies at King's Capital."
          },
          {
            "name": "Scala",
            "description": "Experience with functional programming through projects including a mini compiler, a regular expression matcher, and an implementation of the board game Shogun."
          }
        ]
      },
      {
        "title": "Frameworks & Libraries",
        "skills": [
          {
            "name": "React",
            "description": "Primary frontend framework for this site and professional work at HubSpot and Valtech (Ocado Technologies). Built reusable components, managed state, and shipped production features for both client and personal projects."
          },
          {
            "name": "Node.js",
            "description": "Built backend services and API endpoints for the Meal Planner application."
          },
          {
            "name": "Django",
            "description": "Developed a full-stack tutoring platform and the backend for a client-facing data warehouse interface (MakCorp)."
          },
          {
            "name": "Flask",
            "description": "Over two years of experience. Preferred for lightweight APIs and deploying machine learning models."
          },
          {
            "name": "TensorFlow",
            "description": "Used to build deep learning models, including an LSTM for time-series forecasting and transaction categorisation research at Armalytix."
          }
        ]
      }
    ]
  },
  "projects": [
    {
      "title": "Financial Dashboard with Stock Predictor",
      "description": "Built a financial analytics dashboard combining time-series modelling and sentiment analysis. Implemented an LSTM model in TensorFlow and a sentiment pipeline over financial news and social media, with a JavaScript frontend and a Flask backend.",
      "tags": ["Python", "Machine Learning", "JavaScript", "Flask"],
      "featured": true,
      "images": ["/assets/react.svg"]
    },
    {
      "title": "Meal Planner",
      "description": "Developed a full-stack meal planning application using React and Node.js. Built a personalised recommendation API in Flask using clustering-based similarity models over vectorised recipes, with automated 30-day planning and shopping list generation.",
      "tags": ["Machine Learning", "Python", "Flask", "JavaScript", "React", "Node.js"],
      "featured": false,
      "images": ["/assets/react.svg"]
    },
    {
      "title": "Financial Sentiment Analysis Research & Platform",
      "description": "Co-authored a #research paper# exploring FinBERT applications for sentiment analysis in financial markets. Independently developed and deployed a web-based sentiment analysis tool now actively used by society members as a decision support system for investment decisions and market research.",
      "tags": ["NLP", "Python", "Research"],
      "featured": true,
      "link": "finbert_paper",
      "linkUrl": "/docs/finbert_paper.pdf",
      "images": ["/assets/images/projects/finbert_paper.png", "/assets/images/projects/sentiment_analysis_website.png"]
    },
    {
      "title": "Quantitative Equity Portfolio Management Project - Deutsche Bank Collaboration",
      "description": "Invited by the Global Head of Quantitative Investment Solutions Research at Deutsche Bank to implement strategies from Chincarini & Kim's 'Quantitative Equity Portfolio Management'. Developed and back-tested two systematic portfolio models: a market-neutral strategy eliminating market risk while maximizing alpha, and a beta-neutral strategy with strategic factor tilts to enhance returns. Presented findings to Managing Directors and VPs in Deutsche Bank's Quant team.",
      "tags": ["Machine Learning", "Python"],
      "featured": true,
      "link": "qepm",
      "images": ["/assets/images/projects/qepm_book.png", "/assets/images/projects/qepm_presentation.png"]
    },
    {
      "title": "Customising a client's data warehouse interface",
      "description": "Built a custom data warehouse #website# from scratch using React and Django, working in a small team to deliver client-facing dashboards and backend integrations.",
      "tags": ["JavaScript", "React", "Python", "Django"],
      "featured": false,
      "link": "makcorp",
      "linkUrl": "https://teampuzzled.vercel.app/",
      "images": ["/assets/images/projects/makcorp_website.png"]
    }
  ]
}